//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   Mouse.h
//!
//! @brief  ゲーム関連のヘッダファイル
//!
//! @date   日付
//!
//! @author 制作者名
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once



// 構造体の定義 ============================================================
struct tag_Mouse
{
	Vec2D Pos;
	int CurrentInputState;
	int LastInputState;
};
typedef struct tag_Mouse Mouse;

// 定数の定義 ==============================================================



// グローバル変数の定義 ====================================================
extern Mouse g_mouse;


// 関数の宣言 ==============================================================
void InitializeMouse(void);

void UpdateMouse(void);