//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   SceneSelect.h
//!
//! @brief  ゲーム関連のヘッダファイル
//!
//! @date   日付
//!
//! @author 制作者名
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once






// 関数の宣言 ==============================================================

// ゲームの初期化処理
void InitializeSelect(void);

// ゲームの更新処理
void UpdateSelect(void);

// ゲームの描画処理
void RenderSelect(void);

// ゲームの終了処理
void FinalizeSelect(void);
