//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   ScenePlay.h
//!
//! @brief  ゲーム関連のヘッダファイル
//!
//! @date   日付
//!
//! @author 制作者名
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// 定数の定義 ==============================================================
struct tag_UI
{
	float posX;
	float posY;
	float velX;
	float velY;
	int state;
	Image image;
};
typedef struct tag_UI UI;


// 関数の宣言 ==============================================================

// ゲームの初期化処理
void InitializePlay(void);

// ゲームの更新処理
void UpdatePlay(void);

// ゲームの描画処理
void RenderPlay(void);

// ゲームの終了処理
void FinalizePlay(void);

